data = [
    {Mr. Chim Guanghui: Mr. Chim Guanghui graduated from Institute of Foreign Languages (IFL), China, Australia and the United States of America, Mr. Guanghui Chim has had hands-on experience in Coaching and leading teams in various entities with over 20 years’ experience in Management and Leadership.

Current and previous positions and roles:

Currently serving as Chairman of DG Academy
Currently serving as Chairman of BNI META Chapter
Current Chip Mong Bank Business Advisor
Current ISI Group Business Advisor
Coach to Executive Committee
Independent BoD
Ex Deputy CEO, Hong Leong Bank (Cambodia) Plc.
Ex Chief People & Business Development Officer, Prudential (Cambodia) Plc.
Ex Chief Operation Officer, Prudential (Cambodia) Plc.
Ex Chief Sales Officer, Amret Microfinance Institution Plc.
Ex Head, Consumer Financial Services, Maybank Cambodia
Ex Chief Operating Officer, ANZ Royal Bank, Phnom Penh, Cambodia
    }
    {Mr. Chan Serey: Mr. CHAN Serey is currently an executive coach and highly sought after trainer by public and private company clients. He focused on fostering people management and leadership skills. He had drawn his over twenty years of experiences working at Acleda Bank Plc, where he has grown from entry level position as credit officer up-to senior executive vice president and Group Chief Administration Officer.

           Mr. CHAN Serey, in 1994, worked as Credit Officer in ACLEDA. He was nominated to be Deputy Branch Manager in 1996 and was a branch manager in 1997. In 2000, he was Head of Department of Credit. From 2000 to 2006, he had worked as a Head of Human Resources Division and an Executive Vice President & Group Chief Administrative Officer (EVP & GCAO) in 2008. He retired on August 9, 2016.

As EVP & GCAO, he was responsible for the HR Division, Administration Department, SWIFT Centre, Procurement Centre, and Engineering Department. He was also a member of the Banks’s Executive Committee and responsible for overall strategic plan as well as the implementation of day-to-day operations of the Bank to administration, human resource and head of trainers.

Moreover, in 2011-2015, he became a Chairman for ACLEDA-ASEAN Training Center, and was a member of Board of Directors for ACLEDA MFI Myanmar.

Work history and achievement
In 1998, he attended Financial Institution for Private Enterprise Development (FIPED) in Harvard University, USA. He also joined various training courses and study tours in Thailand, Indonesia, Sri Lanka, Singapore, France…etc.
    
}
 {
    Mr Ngeth Chou: Mr Ngeth Chou

Mr. Ngeth Chou has experiences in real estate and financial services as a professional and entrepreneur. He had held product development and business development roles in microfinance sector, and led a micro-life insurance before moving to become a consultant at a consultancy firm. He then started his own business as entrepreneur in real estate business. He has become an investor and has spoken in many forums in Cambodia.

He obtained his Bachelor’s Degree in Philosophy at Royal University of Phnom Penh, and earned a Master of Business Administration at the National University of Management. He attended Strategic Leadership in Microfinance at Harvard University.  
    
 }

{
    Mr. Gurbakhish (gb) Singh: GURBAKHISH SINGH (GB)

Mr. Gurbakhish (gb) Singh with 30 years in Internal Audit and 18 years in business operations in multiple industries. His wide experience in several roles and especially in implementing Quality assurance improvement programs for Internal Audit functions provides valuable insights, experience, and wisdom into how audit reports should make an impact by adding value and improving business processes.

With over 43 years of value adding experience across a broad range of industries from Manufacturing, Trading, Auto trade, Travel & Shipping, Banking, Plantation Operations, Property development and management, Sales operations, IT hardware & software solutions and many others dealing with a wide variety of nationalities at the most senior levels on very sensitive issues.

Mr. Gurbakhish served in various leadership roles in the areas of Business Risk Management, Corporate Governance, Fraud mitigation, Internal Audit, Finance & Accounting, Administration, Sales Operations, Learning & Development, Total Quality Management. In most appointments, besides his professional responsibilities, he contributed by developing and conducting several in house subject matter-based training programs at the request of his employers.

He has valuable work experience in local companies (Perwira Habib Bank and Island & Peninsular Group) multinationals (Dunlop Estates Group and Inchcape Group) and IT global giant Hewlett Packard Australia.
}
{
    Mr. Hin Sopheap:

Mr. HIN Sopheap has professional experiences in corporate and business strategy development and execution, marketing, managing country and business division, and stakeholder management involving communications and reporting at senior level for international and local organizations in mostly service industry. He has also consulted business entities on strategic planning, devising business plan, and driving innovation, and offered executive coaching to leaders in agro-business, trading, and software development.

He was a country manager for ACCA, a UK-based global accountancy body, and has taken leadership role in running automotive, heavy equipment and truck business at RMA (Cambodia). He was Chief Strategy Officer in charge of group strategy and PR strategy formulation. He graduated with MBA from Asian Institute of Technology with excellent research on strategy. He hosts Strategy and Innovation program at DG Academy where he co-founded.
}
{
    Mr. Yun Phan: Mr. Yun Phan holds the Bachelor’s degree in Mathematics, Bachelor+1’s degree in Mathematics, Bachelor’s degree of English in Education, and Master’s Degree in General Management, and is currently a Ph.D. candidate. He also received a Small Business Training Program Certificate from the NUM & Georgetown University, U.S.A., a Certification of Advanced English Level from Australian Centre for Education

(ACE) and many certificates of leadership and business operation training courses locally and internationally.

*He has received 3 international awards from ANZ Bank and Chevron Corporation. 

Ex-CEO of LY HOUR PAY PRO
Ex Deputy Chief Executive Officer at SBI LY HOUR Bank PLC.
Ex Deputy CEO and COO of LY HOUR MFI PLC
Ex Head of Branch Operations, Senior Channels Operations Manager, Client Service Manager, and Branch Manager at ANZ Royal Bank
Ex Preferred Branch Manager (HQ) at CIMB Bank PLC (Malaysia)
Ex B2B Sales Manager, and a Retail Business Consultant (Regional Manager) at Chevron (Cambodia)Limited known as Caltex
Nominee for the 2015 CEO recognition program of Global ANZ Ban
}

{
    DR. GILBERT NG:

Dr Gilbert NG is an author with his title “The Indubitable Leadership Principles”, a John Maxwell Certified Coach, Teacher and Speaker who has wide exposure in diversified industries in the Asian Region for more than a decade. He has a Doctorate in Human Resource Management and has been invited to be an Ambassador with LIGS University.
He is credentialed as PCC by the International Coach Federation (ICF), a Certified Training Professional (CTP) awarded by ARTDO International, professional member with Australia Institute of Training & Development (AITD), member with Chartered Institute of Marketing (CIM) UK, and Malaysian Institute of Management (MIM).
Dr. Gilbert has also gained vast perspective in leadership during his corporate tenure with the Financial Institutions, Investment, Auto Mobile and Corporate Training Sectors for a few decades locally and overseas.
In his corporate and professional learning journey, he was the Best Regional Manager, First Runner-up Big Branch Award, Best Large Branch Award and Merit for Kids Saving Accounts Awards, Emeritus Leadership Scholar Recipient. Dr. Gilbert is also the Innovative Leader the year 2020-2021, Leadership Excellence Awards.
}

{
    Dr. Siam Monileak: DR. SIEM MONILEAK

Dr. SIEM Monileak is a Deputy Dean of the Faculty of Finance and Accounting of the National University of Management, Cambodia. He served as an Acting Executive Director of the Kampuchea Institute of Certified Public Accountants and Auditors (KICPAA) from May 2016 to December 2019. He was a Consultant to the National Accounting Council of the Ministry of Economy and Finance from March 2008 until April 2016.

Dr. SIEM Monileak hold the Degree of Doctor of Business Administration (DBA) in Finance from the National University of Management in 2017, hold the Degree of Master of Business Administration (MBA) in International Business Management (IBM) in 1999 from the Asian Institute of Technology (AIT), Thailand, and hold the Degree of earned Bachelor of Business Administration in Business Management in 1994 from the Faculty of Business (now, National University of Management), Phnom Penh, Cambodia.

Dr. SIEM Monileak is an associate member (ASA) of CPA , Australia and is a Member of Institute of Public Accountant, Australia
}

{
    Mr. ANDREW SILBERMAN

President & Chief Enthusiast

Mr. Andrew Silberman has been coaching high performance individuals and teams since 1989.  At AMT Group, which he co-founded in Tokyo in 1992, he leads a team of multi-national facilitators whose mission is “Developing Global Thinkers”. His clients are managers and executives from leading multinational firms throughout Asia & the US.
}

{
    
Mr. Somnoas​ Vibol: Mr. Vibol Somnoas is a trainer, MBA, Senior Commercial Profession. He has excessive experiences in corporate profession for more than 23 years, and in key leadership roles over 20 years in various industries of both international and local conglomerates. With his strategic roles in commercial function, he has a strong record of successes in leading & developing his teams to grow business. He has received many awards from his leadership role from various international company where he served and develop many successful successors. He holds his Master Degree in General Management since 2008.

Current and previous positions and roles:

Ex Head of Commercial Division at One Fraternity Limited
Ex Vice President of Loan Business Department at Aeon Specialized Bank (Cambodia) Plc.
Ex Group Director of Sales & Marketing at Innotality Corporation Limited
Ex Business Development Director at One More Group
Ex Head of Sale, Hello Axiata
Ex Head of Trade & Retails, Hello Axiata
Ex Vice President of Sales, First Cambodia Co.,Ltd
Ex Sales & Marketing Manager, Sony Ericsson Mobile Communication
Int’l AB
Ex Management Trainee, Ex Area Manager, Ex Regional Manager, Ex Trade Marketing Manager (Nationwide), British American Tobacco
}
{
    Mr. Tay Kay Luan: TAY KAY LUAN

Mr. Tay Kay Luan has spent many years helping companies to transform and sustain to change.

He has written three books on sustainability concepts, implementation and future. Kay Luan is a certified performance coach, and training professional. His Professional roles and areas of expertise are Strategic planning, Growth Organization development and governance, Professional standards and examinations, Education management, Corporate image and branding, Mentoring and coaching, Succession planning and career, Corporate sustainability, Performance management Diverse stakeholder management.

He had served in senior positions at leading firms such as PWC, The Hay Group, Andersen Consulting, and was Director of ACCA Asian & Australasia, and CEOs of Asian Institute of Chartered Bankers, and Vice Chancellor and CEO of International University of Malaya-Wales.

Kay Luan graduated BA of Social Sciences (Economics, Philosophy, and Politics) from Kingston University, and a Master of Science (Industrial Relations, Sociology, and Manpower Planning) from London School of Economics and Political Science. He is currently a doctoral candidate of University Saints Malaysia.
}

{
    DR. JEAN YVES LE CORRE: Dr Jean-Yves Le Corre is a Practice Academic and an Educational Developer at the Academy of Future Education, Xian-Jiaotong Liverpool University (XJTLU). He was as an Associate Professor of Practice in the Department of at International Business School Suzhou. He is a strong advocate of innovative and technology-enhanced Learning & Teaching practices at XJTLU.

Prior to his academic career, Dr Jean-Yves Le Corre had ten-year corporate experience in several positions at multinational corporations (Lafarge, Areva, KPMG ….) as a controller, an internal auditor and management consultant. He founded a consultancy practice in 2006 to train and coach business executives on risk management, internal audit, multicultural management and leadership in Chinese and South-East Asian contexts.

He holds Engineering Diploma from ENSEM in France, a MSc. in Management from University of London, and a MSc. Of Research in Management granted by the consortium of CFVG’s Doctoral Programme in Vietnam (French-Vietnamese Center of Management). He obtained his PhD degree (Doctor of Philosophy in Business Administration) from Bulacan State University, Republic of the Philippines. He is a Sloan Fellow from London Business School (U.K).

Dr Jean-Yves Le Corre is currently also a researcher at Ecole Doctorable Augustin Cournot, BETA-UMR 7522 CNRS, University of Strasbourg (France).
}

{
    Pro.f Dr.Somboon Mongkolsombat: Pro.f Dr.Somboon Mongkolsombat is a Country Manager for BPC Banking Technology (BPCBT). At BPCBT, Somboon and his team implemented an electronic payment system and transformed banks in Cambodia to move toward digital banking and open banking using SmartVista products. Somboon and his team are responsible to maintain and support twenty-two banks in Cambodia and Lao. BPCBT is a Fintech and Global Payment technology company. At BPCBT, we bridge real life to digital by providing solutions to enable real-life transactions, beyond payments applications and banking commerce systems. BPC is a global payments technology to enable tomorrow’s platform economy today.

Somboon has more than 20 years of experience in banking in the USA. He was a senior programmer/software developer with American Express, First National Bank of Layton, First Security Bank, and Wells Fargo Bank. Somboon worked with one of the best consulting firms in the world, Accenture. He worked five years with Accenture as a senior manager in process competency.

Somboon has more than 15 years of teaching in the USA, Thailand, and Cambodia. He toughs Artificial Intelligent (AI) programming at Weber State University and Utah Community College in Utah, USA. He was an Associate Dean and a computer chairman at the Pannasastra University of Cambodia. Somboon tough Project Management, Business Management, Accounting, and Mathematics for MBA students.

Somboon is the founder of Toastmasters International in Cambodia. He likes to compete in the speech contest. He was a champion in the clubs, areas, and divisions levels in two countries Thailand and the USA. Somboon main hobby is martial arts. He likes to practice Judo, Karate, Aikido, and Thai Boxing. His other hobbies are swimming, jogging, and public speaking. He loves to share his technical skill, communication skills, soft skill, and life experiences with a younger generation.
}

{
    Mr. Sek Socheat: Mr. Sek Socheat is an accomplished IT professional and academic with extensive experience in software engineering and computer applications. Currently a Ph.D. candidate at Huazhong University of Science and Technology, China, he has served in significant roles in private firms and public sector. A part-time lecturer at various Cambodian universities, Mr. Socheat specializes in Artificial Intelligence, IoT, and Digital Image Processing. His career is marked by a strong commitment to technological advancement and education, demonstrated through his numerous IT consultancy projects and academic contributions in the field of computer technology. He speaks at both technology and social events. He also published research on computer applications in professional journals.
}

{
    Mr. Cheam Sithy:

Sithy is currently teaching computer sciences courses at Phnom Penh International University, and also working as consultant in management information system. He had previously worked in a telecommunication company and a software development firm before joining university in various teaching role and as a dean in computer science department. He is very experienced in using Excel and programming works in Excel at advanced level.

He graduated with a bachelor in computer science from Singapore since early 1990s and obtained his Master of Computer Science in Cambodia.
}
{
    DR. Kea Bora: Doctor of Business Administration

European University, Malaysia

Over 20 years experiences in Accounting and Finance, Corporate Business Strategy, Marketing and Sales. Oversea experience to lead the costumer retention management and Sale War Room with Celcom Axiata in Malaysia.

Founder of KSOFT Accounting in Cambodia,

Dr. Bora is a member of Institute Public Accountant, Australia Certified Management Accountant, Australia, Member of CPA Australia, Member of Certified Professional Marketer Asia, and Certified Institute Marketing, UK.

Specialist: Corporate Leadership, Strategic Thinking & Business Planning Management & Business Development, Channel Distribution, Customer Lifecycle Management, Customer Analytic, Finance Analysis, Market Intelligent, Market Analysis, Financial Operation. 
}